package ru.myhousingservice.myservices.model

import androidx.room.Entity
import androidx.room.PrimaryKey
import java.util.*

/********************************************************************************************************
 * Комментарий пользователя к объекту.                                                                  *
 *******************************************************************************************************/
@Entity
class CComment {
    /****************************************************************************************************
     * Идентификатор.                                                                                   *
     ***************************************************************************************************/
    @PrimaryKey
    var id                                  : UUID
            = UUID.randomUUID()
}